Tekla.Structures.Analysis.AnalysisModelOutputProperties
The AnalysisModelOutputProperties class contains information related to analysis model output properties.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputJointCoordinates
Indicates that the joint coordinates are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMemberInformation
Indicates that the member information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputElementInformation
Indicates that the element information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMemberProperties
Indicates that the member properties are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMaterialProperties
Indicates that the material properties are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputSupportInformation
Indicates that the support information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputJointDisplacements
Indicates that the joint displacements re created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMemberForces
Indicates that the member forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputAnalysisResults
Indicates that the analysis results are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMemberSectionForces
Indicates that the member section forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputMemberStresses
Indicates that the member stresses are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputElementJointStresses
Indicates that the element joint stresses are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputElementForces
Indicates that the element forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputElementJointStressesSolid
Indicates that the element joint stresses solid is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputModeShapes
Indicates that the mode shapes are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputSupportReactions
Indicates that the supported reactions are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputEntireSteelTable
Indicates that the entire steel table is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties._OutputStoryDrift
Indicates that the story drift is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputJointCoordinates
Indicates whether the joint coordinates are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMemberInformation
Indicates whether the member information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputElementInformation
Indicates whether the element information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMemberProperties
Indicates whether the member properties are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMaterialProperties
Indicates whether the material properties are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputSupportInformation
Indicates whether the support information is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputJointDisplacements
Indicates whether the joint displacements are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMemberForces
Indicates whether the member forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputAnalysisResults
Indicates whether the analysis results are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMemberSectionForces
Indicates whether the member section forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputMemberStresses
Indicates whether the member stresses are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputElementJointStresses
Indicates whether the element joint stresses are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputElementForces
Indicates whether the element forces are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputElementJointStressesSolid
Indicates whether the element joint stresses solid is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputModeShapes
Indicates whether the mode shapes are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputSupportReactions
Indicates whether the supported reactions are created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputEntireSteelTable
Indicates whether the entire steel table is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.OutputStoryDrift
Indicates whether the story drift is created.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.Modify(System.String)
Inserts the analysis model output properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.Select(System.String)
Selects the analysis model output properties.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelOutputProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelOutputProperties.SelectInstance
DO NOT USE! For internal usage only!